In [1]:
import pandas as pd

In [69]:
df = pd.DataFrame({
    'name': ['  Alice  ', 'bob', 'CHARLIE', 'david 123', 'eve', 'mike-smith'],
    'department': ['IT', 'sales', 'it', 'HR', 'Sales', 'hr']
})

In [70]:
df['name'].str.lower()
df['name'].str.upper()
df['name'].str.title()

0       Alice
1           Bob
2       Charlie
3     David 123
4           Eve
5    Mike-Smith
Name: name, dtype: object

In [71]:
df['name'].str.strip()
df['name'].str.lstrip()
df['name'].str.rstrip()

0         Alice
1           bob
2       CHARLIE
3     david 123
4           eve
5    mike-smith
Name: name, dtype: object

In [101]:
emp = pd.DataFrame({
    'name': [' Jonathan bylers ',' harry potter', 'mickle jackson '],
    'age': [23, 34, 21]
})

In [86]:
emp

                name  age
0   Jonathan bylers    23
1       harry potter   34
2    mickle jackson    21

In [87]:
emp['name'].str.lstrip()

0    Jonathan bylers
1        harry potter
2     mickle jackson
Name: name, dtype: object

In [88]:
emp

                name  age
0   Jonathan bylers    23
1       harry potter   34
2    mickle jackson    21

In [89]:
emp['name'].str.replace('harry','harry potter')

0        Jonathan bylers
1     harry potter potter
2         mickle jackson
Name: name, dtype: object

In [90]:
emp

                name  age
0   Jonathan bylers    23
1       harry potter   34
2    mickle jackson    21

In [91]:
emp['name'].str.contains('h')

0     True
1     True
2    False
Name: name, dtype: bool

In [92]:
data_emp[data_emp['name'].str.startswith('m')]

      name  age
2  mickle    21

In [93]:
data_emp[data_emp['name'].str.endswith('y')]

    name  age
1  harry   34

In [94]:
emp['name'].str.len()

0    17
1    13
2    15
Name: name, dtype: int64

In [103]:
emp['name'].str.split('a', )

0    [ Jon, th, n bylers ]
1         [ h, rry potter]
2       [mickle j, ckson ]
Name: name, dtype: object

In [105]:
emp['name'].str.find('J')

0    1
1   -1
2   -1
Name: name, dtype: int64

In [110]:
emp['name'].str.get(2)

0    o
1    a
2    c
Name: name, dtype: object

In [117]:
emp['name'].str.slice(0, 8)

0     Jonatha
1     harry p
2    mickle j
Name: name, dtype: object